# HardwoodImperfectionsAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Hardwood..::..HardwoodImperfectionsAmount Property
Hardwood Class See Also
---
The property labeled "Amount" from the "Hardwood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string HardwoodImperfectionsAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HardwoodImperfectionsAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ HardwoodImperfectionsAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "-10, 10".
# See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace